package commands;

import utilities.*;

/**
 * Команда 'exit'. Завершает выполнение.
 */
public class Exit extends Command {
    private final Console console;

    public Exit(Console console) {
        super("exit", "выйти");
        this.console = console;
    }

    /**
     * Выполняет команду
     * @return Успешность выполнения команды.
     */
    @Override
    public boolean apply(String[] arguments) {
        if (!arguments[1].isEmpty()) {
            console.println("Использование: '" + getName() + "'");
            return false;
        }

        console.println("⠄⠄⠄⠄⠄⠄⢀⣠⡶⠖⠛⠉⠉⠉⠉⠉⠛⠲⣦⣄⠄⠄⠄⠄\n" +
                "⠄⠄⠄⠄⣤⠖⠋⠁⠄⠄⠄⠄⢀⣴⣿⠛⠙⠛⢷⣤⣈⢿⠄⠄\n" +
                "⠄⠄⣴⠋⠄⠄⠄⠄⣀⣤⣶⠶⠚⠛⠁⠄⠄⠄⠄⠄⠄⠄⣿⠄\n" +
                "⢀⡟⣠⣶⠖⠛⠉⢁⣠⣴⣶⢶⡄⠄⠺⣯⣭⣭⣭⣿⠿⠗⢸⡆\n" +
                "⣾⠄⠄⠄⣴⣞⣉⣈⣿⡿⠛⠁⠄⠄⠄⠄⣻⣦⠶⠛⠉⠙⢿⡇\n" +
                "⣿⠄⠄⠄⠄⠄⠄⠄⠄⠄⢀⣠⣤⠶⠛⠉⠄⠄⠄⠄⠄⡶⢻⠁\n" +
                "⣿⠄⠄⠄⠄⠄⠛⠛⠛⠉⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⢰⡇⣿⠄\n" +
                " ⠘⣆⠄⠄⠄⠄⠄⠄⠄⢀⠄⠄⠄⠄⠄⠄⠄⠄⠄⢠⡟⣼⠃⠄\n" +
                "⠄⠹⣄⠄⠄⠄⠄⠄⠄⠄⠛⣦⣀⠄⠄⠄⠄⣠⡶⠋⣼⠃⠄⠄\n" +
                "⠄⠄⠈⠛⣦⡀⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⣠⡾⠋⠄⠄⠄⠄\n" +
                "⠄⠄⠄⠄⠄⠈⠉⠛⠛⠶⣤⣿⣿⣴⣶⠛⠉⠄⠄⠄⠄⠄⠄⠄\n" +
                "⠄⠄⠄⠄⠄⠄⠄⠄⠄⣰⠋⢸⠄⠙⢷⡀⠄⠄⠄⠄⠄⠄⠄⠄\n" +
                "⠄⠄⠄⠄⠄⠄⠄⠄⣾⠁⠄⢸⠄⠄⠄⠈⢷⡀⠄⠄⠄⠄⠄⠄\n" +
                "⠄⠄⠄⠄⠄⠄⢠⡟⠄⠄⠄⢸⡆⠄⠄⠄⠄⠘⢶⡀⠄⠄⠄⠄\n" +
                "⠄⠄⠄⠄⠄⣾⠃⠄⠄⠄⠄⠄⣇⠄⠄⠄⠄⠄⠄⠻⡄⠄⠄⠄\n" +
                "⠄⠄⠄⢀⡿⠄⠄⠄⠄⠄⠄⣀⣿⣀⣀⣀⣀⣀⣀⡀⢹⣦⣤⠄\n" +
                "⢀⣤⣶⣿⣿⣷⣶⠟⠛⠉⠄⠄⢸⡄⠄⠄⠉⠙⠛⠿⣿⣿⣦⢻\n" +
                "⠄⣸⠃⢿⠄⠄⠄⠄⠄⠄⠄⠄⠄⡇⠄⠄⠄⠄⠄⠄⠘⣿⠄⠄".indent(1));

        console.println("Увидимся на допсе...");
        return true;

    }
}